{
	"intents": [{
			"tag": "fallback",
			"patterns": [
				"I don't know what am i doing here.",
				"why is this not working"
			],
			"responses": ["Sorry, I cannot answer your question."]
		},
		{
			"tag": "thanks",
			"patterns": [
				"OK thanks. Good.",
				"Thank you.",
				"That would be great, thank you!",
				"thank you so much",
				"ok thank you",
				"It was very helpful.",
				"Ok great. Thank you!",
				"Sounds good"
			],
			"responses": [
				"Thanks",
				"That is great to hear."
			]
		},
		{
			"tag": "reserve table",
			"patterns": [
				"Can you please reserve me a table for tonight",
				"I need a table for next tuesday",
				"Can i make a reservation one month in advance",
				"is there any chance that you have a table for tonight"
			],
			"responses": [
				"To make reservations please use our app or website. Thanks"
			]
		},
		{
			"tag": "vegetarian",
			"patterns": [
				"Do you have any vegetarian dishes in your menu.",
				"what can i order if i am vegetarian.",
				"i cannot eat meat, do you have any options for me.",
				"I don't like meat do you have something with legumes."
			],
			"responses": [
				"Yes we have vegetarian options, dishes with tofu, shiitake or aubergine"
			]
		},
		{
			"tag": "allergies",
			"patterns": [
				"Sorry, I have an allergy to peanuts, can i be safe eating in your restaurant",
				"My child cannot eat any seafood he is allergic, can i change the type of meat in the dish",
				"I can't eat gluten , do you offer any dishes for people like me",
				"I have allergies **** /// ",
				"i have 123allergies 657.???  255 895 325 %%"
			],
			"responses": [
				"Sorry but most of our dishes use peanut oil. If you are celiac we have plenty of options for you",
				"If you have an allergy please notify the waiter, he will guide you. We do not recommend eating here if you suffer from peanut allergy"
			]
		},
		{
			"tag": "fruits in menu",
			"patterns": [
				"do you use fresh fruit in your preparations",
				"can i order fresh fruit i have a dietary restriction",
				"which dishes use fresh fruit i can only eat that"
			],
			"responses": [
				"We use fresh fruit in two of our desserts. We can also serve a plate of fresh fruit on demand."
			]
		},
		{
			"tag": "asking for help",
			"patterns": [
				"can you please help me ",
				"i have a question",
				"i do have a question",
				"can i have some assistance."
			],
			"responses": [
				"Yes, I can help you please write your request."
			]
		}

	]
}